<!DOCTYPE html SYSTEM "about:legacy-compat">
<html lang="en-US" data-preset="contrast" data-primary-color="#307FFF"><head><meta http-equiv="Content-Type" content="text/html; charset=UTF-8"><meta charset="UTF-8"><meta name="robots" content="noindex"><meta name="built-on" content="2024-04-03T16:56:02.413436464"><title>Section 4 : Les tranches | Help Instance</title><script type="application/json" id="virtual-toc-data">[{"id":"comment-les-tranches-g-rent-la-m-moire","level":0,"title":"Comment les tranches gèrent la mémoire","anchor":"#comment-les-tranches-g-rent-la-m-moire"}]</script><script type="application/json" id="topic-shortcuts"></script><link href="https://resources.jetbrains.com/writerside/apidoc/6.6.6-b224/app.css" rel="stylesheet"><link rel="manifest" href="site.webmanifest"><meta name="msapplication-TileColor" content="#000000"><link rel="apple-touch-icon" sizes="180x180" href="https://jetbrains.com/apple-touch-icon.png"><link rel="icon" type="image/png" sizes="32x32" href="https://jetbrains.com/favicon-32x32.png"><link rel="icon" type="image/png" sizes="16x16" href="https://jetbrains.com/favicon-16x16.png"><meta name="msapplication-TileImage" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-144x144.png"><meta name="msapplication-square70x70logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-70x70.png"><meta name="msapplication-square150x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-150x150.png"><meta name="msapplication-wide310x150logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x150.png"><meta name="msapplication-square310x310logo" content="https://resources.jetbrains.com/storage/ui/favicons/mstile-310x310.png"><meta name="image" content=""><!-- Open Graph --><meta property="og:title" content="Section 4 : Les tranches | Help Instance"><meta property="og:description" content=""><meta property="og:image" content=""><meta property="og:site_name" content="Help Instance Help"><meta property="og:type" content="website"><meta property="og:locale" content="en_US"><meta property="og:url" content="writerside-documentation/ch06s04-section-4-les-tranches.html"><!-- End Open Graph --><!-- Twitter Card --><meta name="twitter:card" content="summary_large_image"><meta name="twitter:site" content=""><meta name="twitter:title" content="Section 4 : Les tranches | Help Instance"><meta name="twitter:description" content=""><meta name="twitter:creator" content=""><meta name="twitter:image:src" content=""><!-- End Twitter Card --><!-- Schema.org WebPage --><script type="application/ld+json">{
    "@context": "http://schema.org",
    "@type": "WebPage",
    "@id": "writerside-documentation/ch06s04-section-4-les-tranches.html#webpage",
    "url": "writerside-documentation/ch06s04-section-4-les-tranches.html",
    "name": "Section 4 : Les tranches | Help Instance",
    "description": "",
    "image": "",
    "inLanguage":"en-US"
}</script><!-- End Schema.org --><!-- Schema.org WebSite --><script type="application/ld+json">{
    "@type": "WebSite",
    "@id": "writerside-documentation/#website",
    "url": "writerside-documentation/",
    "name": "Help Instance Help"
}</script><!-- End Schema.org --></head><body data-id="ch06s04-Section-4-Les-tranches" data-main-title="Section 4 : Les tranches" data-article-props="{&quot;seeAlsoStyle&quot;:&quot;links&quot;}" data-template="article" data-breadcrumbs="ch06-Gestion-de-la-memoire.md|Chapitre 6 : Gestion de la mémoire"><div class="wrapper"><main class="panel _main"><header class="panel__header"><div class="container"><h3>Help Instance  Help</h3><div class="panel-trigger"></div></div></header><section class="panel__content"><div class="container"><article class="article" data-shortcut-switcher="inactive"><h1 data-toc="ch06s04-Section-4-Les-tranches" id="ch06s04-Section-4-Les-tranches.md">Section 4 : Les tranches</h1><p id="ex8vqn_2">Les tranches (<span class="emphasis" id="ex8vqn_3">slices</span>) sont une abstraction au-dessus des tableaux. Elles se composent de trois composants :</p><ol class="list _decimal" id="ex8vqn_4" type="1"><li class="list__item" id="ex8vqn_5"><p>un pointeur vers un tableau,</p></li><li class="list__item" id="ex8vqn_6"><p>une longueur et</p></li><li class="list__item" id="ex8vqn_7"><p>une capacit&eacute;.</p></li></ol><p id="ex8vqn_8">Lorsqu'une tranche est cr&eacute;&eacute;e, un tableau sous-jacent est &eacute;galement cr&eacute;&eacute;. La tranche pointe vers ce tableau, et la taille de la tranche ne peut jamais d&eacute;passer la taille du tableau sous-jacent.</p><p id="ex8vqn_9">Voici un exemple de cr&eacute;ation de tranche :</p><div class="code-block" data-lang="go">
s := make([]int, 5, 10) // Crée une tranche de longueur 5 et de capacité 10
</div><p id="ex8vqn_11">Dans cet exemple, un tableau de 10 &eacute;l&eacute;ments est cr&eacute;&eacute; dans le tas, et une tranche de longueur 5 est cr&eacute;&eacute;e qui pointe vers les cinq premiers &eacute;l&eacute;ments de ce tableau. Les cinq &eacute;l&eacute;ments restants sont r&eacute;serv&eacute;s pour permettre &agrave; la tranche de s'&eacute;tendre.</p><p id="ex8vqn_12">Il est important de noter que les tranches, &eacute;tant une structure de donn&eacute;es dynamique, sont <span class="control" id="ex8vqn_13">presque toujours allou&eacute;es sur le tas</span>, du moins pour le tableau sous-jacent, m&ecirc;me si leur taille est connue au moment de la compilation.</p><p id="ex8vqn_14">Mais comme toujours en Go, les d&eacute;tails pr&eacute;cis de l'allocation de m&eacute;moire peuvent d&eacute;pendre de nombreux facteurs et peuvent &ecirc;tre g&eacute;r&eacute;s par le <span class="emphasis" id="ex8vqn_15">runtime</span> Go. Par exemple, pour les tranches tr&egrave;s petites, Go pourrait d&eacute;cider de les allouer sur la pile au lieu du tas pour des raisons de performances. Cependant, ce sont des d&eacute;tails d'impl&eacute;mentation qui ne sont g&eacute;n&eacute;ralement pas expos&eacute;s &agrave; l'utilisateur.</p><section class="chapter"><h2 id="comment-les-tranches-g-rent-la-m-moire" data-toc="comment-les-tranches-g-rent-la-m-moire">Comment les tranches g&egrave;rent la m&eacute;moire</h2><p id="ex8vqn_16">Lorsque vous cr&eacute;ez une tranche, Go alloue dynamiquement un tableau sous-jacent et renvoie une tranche qui fait r&eacute;f&eacute;rence &agrave; une partie de ce tableau. Si vous augmentez la taille de la tranche au-del&agrave; de la capacit&eacute; de ce tableau, Go alloue un nouveau tableau, copie les &eacute;l&eacute;ments existants dans le nouveau tableau, puis met &agrave; jour la tranche pour qu'elle pointe vers le nouveau tableau. Ce processus est appel&eacute; <span class="control" id="ex8vqn_17">redimensionnement dynamique</span>.</p><p id="ex8vqn_18">Par exemple, lorsque vous utilisez <code class="code" id="ex8vqn_19">append</code> pour ajouter un &eacute;l&eacute;ment &agrave; une tranche, si la tranche a de la capacit&eacute; disponible dans son tableau sous-jacent, l'&eacute;l&eacute;ment sera ajout&eacute; dans cet espace. Si la tranche est d&eacute;j&agrave; au maximum de sa capacit&eacute;, un nouveau tableau sera cr&eacute;&eacute; avec une capacit&eacute; doubl&eacute;e, tous les &eacute;l&eacute;ments existants seront copi&eacute;s, et le nouvel &eacute;l&eacute;ment sera ajout&eacute; &agrave; la suite.</p><p id="ex8vqn_20">Il convient de noter que lorsqu'une tranche est redimensionn&eacute;e, l'ancien tableau sous-jacent reste en m&eacute;moire jusqu'&agrave; ce qu'il soit &eacute;limin&eacute; par le <span class="emphasis" id="ex8vqn_21">garbage collector</span> de Go. Cela peut entra&icirc;ner une utilisation non optimale de la m&eacute;moire si le tableau sous-jacent d'une tranche est grand et que seul un petit sous-ensemble de celui-ci est encore n&eacute;cessaire. Pour &eacute;viter une telle situation, vous pourriez utiliser la fonction <code class="code" id="ex8vqn_22">copy</code> et <code class="code" id="ex8vqn_23">runtime.GC</code> de Go pour copier la tranche dans un petit tableau sous-jacent et forcer le <span class="emphasis" id="ex8vqn_24">garbage collector</span> &agrave; &eacute;liminer l'ancien grand tableau.</p><p id="ex8vqn_25">En r&eacute;sum&eacute;, les tranches en Go fournissent une abstraction flexible et facile &agrave; utiliser pour travailler avec des s&eacute;quences de donn&eacute;es, mais il est important de comprendre comment elles g&egrave;rent la m&eacute;moire sous-jacente pour &eacute;viter les &eacute;cueils potentiels.</p><section class="chapter"><h3 id="tranches-de-structures-vs-tranches-de-pointeurs-vers-des-structures" data-toc="tranches-de-structures-vs-tranches-de-pointeurs-vers-des-structures">Tranches de structures vs. tranches de pointeurs vers des structures</h3><p id="ex8vqn_26">Travailler avec des tranches de structures ou des tranches de pointeurs vers des structures peut avoir un impact significatif sur la fa&ccedil;on dont la m&eacute;moire est utilis&eacute;e et g&eacute;r&eacute;e.</p><p id="ex8vqn_27">Consid&eacute;rons un exemple o&ugrave; <code class="code" id="ex8vqn_28">Person</code> est une structure avec quelques champs. Si vous cr&eacute;ez une tranche de <code class="code" id="ex8vqn_29">Person</code>, chaque <code class="code" id="ex8vqn_30">Person</code> dans la tranche est stock&eacute;e en tant que valeur. Cela signifie que si vous passez des &eacute;l&eacute;ments de la tranche &agrave; une fonction ou si vous les copiez dans une nouvelle tranche, vous cr&eacute;ez une copie de ces structures. Cette copie repr&eacute;sente un co&ucirc;t en termes de performances et d'utilisation de la m&eacute;moire, surtout si les structures sont grandes.</p><div class="code-block" data-lang="go">
people := []Person{
    {Name: &quot;John&quot;, Age: 30},
    {Name: &quot;Jane&quot;, Age: 25},
}
</div><p id="ex8vqn_32">D'autre part, si vous cr&eacute;ez une tranche de pointeurs vers des structures <code class="code" id="ex8vqn_33">Person</code>, vous ne stockez que les adresses m&eacute;moire des structures dans la tranche. Lorsque vous passez ces &eacute;l&eacute;ments &agrave; une fonction ou les copiez dans une nouvelle tranche, vous copiez seulement les pointeurs, pas les structures elles-m&ecirc;mes. Cela peut &ecirc;tre plus efficace en termes d'utilisation de la m&eacute;moire et de performance, surtout pour les grandes structures. De plus, puisque vous travaillez avec des pointeurs, toute modification apport&eacute;e &agrave; la structure &agrave; travers le pointeur sera refl&eacute;t&eacute;e dans toute votre application, car tous les pointeurs se r&eacute;f&egrave;rent au m&ecirc;me emplacement m&eacute;moire.</p><div class="code-block" data-lang="go">
people := []*Person{
    &amp;Person{Name: &quot;John&quot;, Age: 30},
    &amp;Person{Name: &quot;Jane&quot;, Age: 25},
}
</div><p id="ex8vqn_35">Cependant, il convient de noter que travailler avec des pointeurs peut compliquer la gestion de la m&eacute;moire. Par exemple, si une structure est supprim&eacute;e &agrave; un endroit, mais que des pointeurs vers cette structure existent toujours ailleurs dans le programme, cela peut entra&icirc;ner des bugs subtils et difficiles &agrave; rep&eacute;rer.</p><p id="ex8vqn_36">Il n'y a pas de r&egrave;gle stricte pour d&eacute;terminer quand utiliser des tranches de structures ou des tranches de pointeurs &agrave; des structures. Cela d&eacute;pend principalement de vos besoins sp&eacute;cifiques. Si la taille de votre structure est petite et que les effets de la copie de structures ne sont pas significatifs, les tranches de structures peuvent suffire. Si les structures sont grandes ou si vous avez besoin de modifications en place sur la structure &agrave; travers le programme, les tranches de pointeurs vers des structures peuvent &ecirc;tre pr&eacute;f&eacute;rables.</p></section></section><div class="last-modified">Last modified: 03 avril 2024</div><div data-feedback-placeholder="true"></div><div class="navigation-links _bottom"><a href="ch06s03-section-3-le-vidangeur.html" class="navigation-links__prev">Section 3 : Le vidangeur</a><a href="ch06s04-operations-sur-les-tranches.html" class="navigation-links__next">Op&eacute;rations sur les tranches</a></div></article><div id="disqus_thread"></div></div></section></main></div><script src="https://resources.jetbrains.com/writerside/apidoc/6.6.6-b224/app.js"></script></body></html>